# InitialIlluminanceIntensity Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialIlluminanceIntensity Class
Members See Also
---
This class encapsulates initial illuminance intensity calculation.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class InitialIlluminanceIntensity : InitialIntensity
```

Visual Basic
---
```text
Public Class InitialIlluminanceIntensity _
	Inherits InitialIntensity
```

Visual C++
---
```text
public ref class InitialIlluminanceIntensity : public InitialIntensity
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..InitialIntensity Autodesk.Revit.DB.Lighting..::..InitialIlluminanceIntensity
# See Also
InitialIlluminanceIntensity Members
Autodesk.Revit.DB.Lighting Namespace